[
  "symbols-prettifier",
  "obsidian-git",
  "quick-latex",
  "better-word-count",
  "various-complements",
  "obsidian-dynamic-toc",
  "obsidian-excel-to-markdown-table",
  "obsidian-pandoc",
  "table-extended",
  "cm-editor-syntax-highlight-obsidian",
  "obsidian-checklist-plugin",
  "code-block-copy",
  "obsidian-indent-lines",
  "obsidian-html-tags-autocomplete",
  "table-editor-obsidian"
]