[
  "symbols-prettifier",
  "obsidian-git",
  "quick-latex",
  "better-word-count",
  "various-complements",
  "obsidian-dynamic-toc",
  "obsidian-excel-to-markdown-table",
  "obsidian-pandoc",
  "table-extended",
  "cm-editor-syntax-highlight-obsidian",
  "obsidian-checklist-plugin",
  "code-block-copy",
  "obsidian-indent-lines",
  "obsidian-html-tags-autocomplete",
  "table-editor-obsidian",
  "easy-typing-obsidian",
  "advanced-cursors",
  "obsidian-extract-pdf-annotations",
  "obsidian-toggle-list",
  "obsidian-advanced-slides",
  "obsidian-discordrpc",
  "mermaid-tools",
  "obsidian-style-settings",
  "obsidian-advanced-new-file",
  "obsidian-focus-mode",
  "dataview"
]